Revit 2024 API
FabricationPart.InsulationType Property
 The insulation type of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string InsulationType { get; }
Visual Basic
Public ReadOnly Property InsulationType As String
	Get
Visual C++
public:
property String^ InsulationType {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace